{
  "return_dict": true,
  "output_hidden_states": false,
  "torchscript": false,
  "dtype": "float32",
  "pruned_heads": {},
  "tie_word_embeddings": true,
  "chunk_size_feed_forward": 0,
  "is_encoder_decoder": false,
  "is_decoder": false,
  "cross_attention_hidden_size": null,
  "add_cross_attention": false,
  "tie_encoder_decoder": false,
  "architectures": [
    "XLMRobertaForMaskedLM"
  ],
  "finetuning_task": null,
  "id2label": {
    "0": "Arabic",
    "1": "Chinese",
    "2": "Dutch",
    "3": "English",
    "4": "Estonian",
    "5": "French",
    "6": "Hindi",
    "7": "Indonesian",
    "8": "Japanese",
    "9": "Korean",
    "10": "Latin",
    "11": "Persian",
    "12": "Portugese",
    "13": "Pushto",
    "14": "Romanian",
    "15": "Russian",
    "16": "Spanish",
    "17": "Swedish",
    "18": "Tamil",
    "19": "Thai",
    "20": "Turkish",
    "21": "Urdu"
  },
  "label2id": {
    "Arabic": 0,
    "Chinese": 1,
    "Dutch": 2,
    "English": 3,
    "Estonian": 4,
    "French": 5,
    "Hindi": 6,
    "Indonesian": 7,
    "Japanese": 8,
    "Korean": 9,
    "Latin": 10,
    "Persian": 11,
    "Portugese": 12,
    "Pushto": 13,
    "Romanian": 14,
    "Russian": 15,
    "Spanish": 16,
    "Swedish": 17,
    "Tamil": 18,
    "Thai": 19,
    "Turkish": 20,
    "Urdu": 21
  },
  "task_specific_params": null,
  "problem_type": null,
  "tokenizer_class": null,
  "prefix": null,
  "bos_token_id": 0,
  "pad_token_id": 1,
  "eos_token_id": 2,
  "sep_token_id": null,
  "decoder_start_token_id": null,
  "max_length": 20,
  "min_length": 0,
  "do_sample": false,
  "early_stopping": false,
  "num_beams": 1,
  "temperature": 1.0,
  "top_k": 50,
  "top_p": 1.0,
  "typical_p": 1.0,
  "repetition_penalty": 1.0,
  "length_penalty": 1.0,
  "no_repeat_ngram_size": 0,
  "encoder_no_repeat_ngram_size": 0,
  "bad_words_ids": null,
  "num_return_sequences": 1,
  "output_scores": false,
  "return_dict_in_generate": false,
  "forced_bos_token_id": null,
  "forced_eos_token_id": null,
  "remove_invalid_values": false,
  "exponential_decay_length_penalty": null,
  "suppress_tokens": null,
  "begin_suppress_tokens": null,
  "num_beam_groups": 1,
  "diversity_penalty": 0.0,
  "_name_or_path": "xlm-roberta-base",
  "transformers_version": "4.57.3",
  "model_type": "xlm-roberta",
  "output_past": true,
  "tf_legacy_loss": false,
  "use_bfloat16": false,
  "vocab_size": 250002,
  "hidden_size": 768,
  "num_hidden_layers": 12,
  "num_attention_heads": 12,
  "hidden_act": "gelu",
  "intermediate_size": 3072,
  "hidden_dropout_prob": 0.1,
  "attention_probs_dropout_prob": 0.1,
  "max_position_embeddings": 514,
  "type_vocab_size": 1,
  "initializer_range": 0.02,
  "layer_norm_eps": 1e-05,
  "position_embedding_type": "absolute",
  "use_cache": true,
  "classifier_dropout": null,
  "output_attentions": false
}